; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-24)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room4)
(at ball12 room4)
(at ball13 room5)
(at ball14 room5)
(at ball15 room5)
(at ball16 room5)
(at ball17 room5)
(at ball18 room5)
(at ball19 room6)
(at ball20 room6)
(at ball21 room6)
(at ball22 room6)
(at ball23 room6)
(at ball24 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
)
)
)

; plan
1. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 6 of 24
2. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 6 of 24
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 6 of 24
4. (drop ball1 room3 right)
   deleted: (carry ball1 right)
   added: (at ball1 room3) (free right)
   goals met: 7 of 24
5. (drop ball2 room3 left)
   deleted: (carry ball2 left)
   added: (at ball2 room3) (free left)
   goals met: 8 of 24
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 8 of 24
7. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 8 of 24
8. (pick ball3 roomb right)
   deleted: (at ball3 roomb) (free right)
   added: (carry ball3 right)
   goals met: 8 of 24
9. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 8 of 24
10. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 8 of 24
11. (drop ball3 room3 right)
   deleted: (carry ball3 right)
   added: (at ball3 room3) (free right)
   goals met: 9 of 24
12. (drop ball4 room3 left)
   deleted: (carry ball4 left)
   added: (at ball4 room3) (free left)
   goals met: 10 of 24
13. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 10 of 24
14. (pick ball24 room6 left)
   deleted: (at ball24 room6) (free left)
   added: (carry ball24 left)
   goals met: 10 of 24
15. (pick ball23 room6 right)
   deleted: (at ball23 room6) (free right)
   added: (carry ball23 right)
   goals met: 10 of 24
16. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 10 of 24
17. (drop ball23 room3 right)
   deleted: (carry ball23 right)
   added: (at ball23 room3) (free right)
   goals met: 11 of 24
18. (drop ball24 room3 left)
   deleted: (carry ball24 left)
   added: (at ball24 room3) (free left)
   goals met: 12 of 24
19. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 12 of 24
20. (pick ball22 room6 left)
   deleted: (at ball22 room6) (free left)
   added: (carry ball22 left)
   goals met: 12 of 24
21. (pick ball21 room6 right)
   deleted: (at ball21 room6) (free right)
   added: (carry ball21 right)
   goals met: 12 of 24
22. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 12 of 24
23. (drop ball21 room3 right)
   deleted: (carry ball21 right)
   added: (at ball21 room3) (free right)
   goals met: 13 of 24
24. (drop ball22 room3 left)
   deleted: (carry ball22 left)
   added: (at ball22 room3) (free left)
   goals met: 14 of 24
25. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 14 of 24
26. (pick ball20 room6 left)
   deleted: (at ball20 room6) (free left)
   added: (carry ball20 left)
   goals met: 14 of 24
27. (pick ball19 room6 right)
   deleted: (at ball19 room6) (free right)
   added: (carry ball19 right)
   goals met: 14 of 24
28. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 14 of 24
29. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 14 of 24
30. (drop ball19 room3 right)
   deleted: (carry ball19 right)
   added: (at ball19 room3) (free right)
   goals met: 15 of 24
31. (drop ball20 room3 left)
   deleted: (carry ball20 left)
   added: (at ball20 room3) (free left)
   goals met: 16 of 24
32. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 16 of 24
33. (pick ball18 room5 left)
   deleted: (at ball18 room5) (free left)
   added: (carry ball18 left)
   goals met: 16 of 24
34. (pick ball17 room5 right)
   deleted: (at ball17 room5) (free right)
   added: (carry ball17 right)
   goals met: 16 of 24
35. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 16 of 24
36. (drop ball17 room3 right)
   deleted: (carry ball17 right)
   added: (at ball17 room3) (free right)
   goals met: 17 of 24
37. (drop ball18 room3 left)
   deleted: (carry ball18 left)
   added: (at ball18 room3) (free left)
   goals met: 18 of 24
38. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 18 of 24
39. (pick ball16 room5 left)
   deleted: (at ball16 room5) (free left)
   added: (carry ball16 left)
   goals met: 18 of 24
40. (pick ball15 room5 right)
   deleted: (at ball15 room5) (free right)
   added: (carry ball15 right)
   goals met: 18 of 24
41. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 18 of 24
42. (drop ball15 room3 right)
   deleted: (carry ball15 right)
   added: (at ball15 room3) (free right)
   goals met: 19 of 24
43. (drop ball16 room3 left)
   deleted: (carry ball16 left)
   added: (at ball16 room3) (free left)
   goals met: 20 of 24
44. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 20 of 24
45. (pick ball14 room5 left)
   deleted: (at ball14 room5) (free left)
   added: (carry ball14 left)
   goals met: 20 of 24
46. (pick ball13 room5 right)
   deleted: (at ball13 room5) (free right)
   added: (carry ball13 right)
   goals met: 20 of 24
47. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 20 of 24
48. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 20 of 24
49. (drop ball13 room3 right)
   deleted: (carry ball13 right)
   added: (at ball13 room3) (free right)
   goals met: 21 of 24
50. (drop ball14 room3 left)
   deleted: (carry ball14 left)
   added: (at ball14 room3) (free left)
   goals met: 22 of 24
51. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 22 of 24
52. (pick ball12 room4 left)
   deleted: (at ball12 room4) (free left)
   added: (carry ball12 left)
   goals met: 22 of 24
53. (pick ball11 room4 right)
   deleted: (at ball11 room4) (free right)
   added: (carry ball11 right)
   goals met: 22 of 24
54. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 22 of 24
55. (drop ball12 room3 left)
   deleted: (carry ball12 left)
   added: (at ball12 room3) (free left)
   goals met: 23 of 24
56. (drop ball11 room3 right)
   deleted: (carry ball11 right)
   added: (at ball11 room3) (free right)
   goals met: 24 of 24
